
//追加部分
$(document).ready(function () {
console.log(a);

    var prefs = [
        ['北海道', 43.03, 141.21],
        ['青森県', 40.49, 140.44],
        ['岩手県', 39.42, 141.09],
        ['宮城県', 38.16, 140.52],
        ['秋田県', 39.43, 140.06],
        ['山形県', 38.15, 140.20],
        ['福島県', 37.45, 140.28],
        ['茨城県', 36.22, 140.28],
        ['栃木県', 36.33, 139.53],
        ['群馬県', 36.23, 139.03],
        ['埼玉県', 35.51, 139.38],
        ['千葉県', 35.36, 140.06],
        ['東京都', 35.41, 139.45],
        ['神奈川県', 35.26, 139.38],
        ['新潟県', 37.55, 139.02],
        ['富山県', 36.41, 137.13],
        ['石川県', 36.33, 136.39],
        ['福井県', 36.03, 136.13],
        ['山梨県', 35.39, 138.34],
        ['長野県', 36.39, 138.11],
        ['岐阜県', 35.25, 136.45],
        ['静岡県', 34.58, 138.23],
        ['愛知県', 35.11, 136.54],
        ['三重県', 34.43, 136.30],
        ['滋賀県', 35.00, 135.52],
        ['京都府', 35.00, 135.46],
        ['大阪府', 34.41, 135.29],
        ['兵庫県', 34.41, 135.11],
        ['奈良県', 34.41, 135.48],
        ['和歌山県', 34.14, 135.10],
        ['鳥取県', 35.29, 134.13],
        ['島根県', 35.27, 133.04],
        ['岡山県', 34.39, 133.54],
        ['広島県', 34.23, 132.27],
        ['山口県', 34.11, 131.27],
        ['徳島県', 34.03, 134.32],
        ['香川県', 34.20, 134.02],
        ['愛媛県', 33.50, 132.44],
        ['高知県', 33.33, 133.31],
        ['福岡県', 33.35, 130.23],
        ['佐賀県', 33.16, 130.16],
        ['長崎県', 32.45, 129.52],
        ['熊本県', 32.48, 130.42],
        ['大分県', 33.14, 131.37],
        ['宮崎県', 31.56, 131.25],
        ['鹿児島県', 31.36, 130.33],
        ['沖縄県', 26.13, 127.41]
    ];

    console.log(prefs);

    navigator.geolocation.getCurrentPosition(function (pos) {
        var lat = pos.coords.latitude;
        var long = pos.coords.longitude;
        $.each(prefs, function (i, p) {
            p[3] = (lat - p[1]) * (lat - p[1]) + (long - p[2]) * (long - p[2]);
        });
        prefs.sort(function (p1, p2) {
            return p1[3] - p2[3];
        });
    });

})
let a = window.localStorage.getItem('kekka');
console.log(a);
let array = {
    nemui: a
};
console.log(array);
let result_img;
switch (a) {
    //手洗いタグ
    case ("hand"):
        result_img = "img/tag/how_to_wash/img19.gif";
        result_description = "液温は40℃を限度とし、手洗いができる";
        break;
}
$('.result_box').children('img').attr('src', result_img);
$('#description').html(result_description);

window.localStorage.removeItem('kekka');
let b = window.localStorage.getItem('kekka');
